---
kind: property
id: P:Autodesk.Revit.DB.Form.PathCurveCount
zh: 对话框、窗口、窗体
source: html/2469b633-67ff-6f8e-bb07-c427d968aba9.htm
---
# Autodesk.Revit.DB.Form.PathCurveCount Property

**中文**: 对话框、窗口、窗体

The number of curves in the form path.

## Syntax (C#)
```csharp
public int PathCurveCount { get; }
```